#+TITLE: Reports

ECM has reports. This process is about running them and presenting
them.

* Database

#+PROPERTY: header-args:sql :engine postgres :cmdline "\"host=maxbakuntu.lan port=5432 user=maxclaims dbname=maxclaims\""

#+begin_src sql
  CREATE OR REPLACE FUNCTION percentage_diff (a int, b int)
   RETURNS int LANGUAGE SQL AS $$
    SELECT (((a - b) / ((a + b) / 2)) * 100)::int
     FROM (SELECT $1::numeric as a, $2 as b) num;
  $$;
  CREATE OR REPLACE FUNCTION percentage_diff (a numeric, b numeric)
   RETURNS int LANGUAGE SQL AS $$
    SELECT (((a - b) / ((a + b) / 2)) * 100)::int
     FROM (SELECT $1::numeric as a, $2 as b) num;
  $$;

  CREATE OR REPLACE FUNCTION percentage_change (a numeric, b numeric)
   RETURNS int LANGUAGE SQL AS $$
    SELECT (((a - b) / b ) * 100)::int
     FROM (SELECT $1 as a, $2 as b) num;
  $$;

#+end_src

Open claims this week, last week, and %change

#+begin_src sql :noweb-ref open-perc-diff-sql
  SELECT *, percentage_change(master_this_week::int, master_last_week::int) AS percentage_diff
  FROM (SELECT opened_this_week - children_this_week AS master_this_week,
         opened_last_week - children_last_week AS master_last_week
  FROM
  (SELECT (this_week).*, opened_last_week, children_last_week
  FROM (SELECT this_week, count(claim_id) AS opened_last_week,
         count(group_leader_id) AS children_last_week
  FROM
   (SELECT rng.start, rng.end,
         count(this_week.claim_id) AS opened_this_week,
         count(this_week.group_leader_id) AS children_this_week
   FROM (SELECT (e.end - interval '1 week') AS start,
       	      e.end FROM (SELECT now() - interval '1 week' AS end) e) rng
   LEFT JOIN claim this_week
   ON (this_week.open_date::timestamp with time zone <@ tstzrange(rng.end, now()))
   GROUP BY "start", "end") this_week
   LEFT JOIN claim last_week
   ON (last_week.open_date::timestamp with time zone <@ tstzrange(this_week.start, this_week.end))
   GROUP BY this_week) wkd) rep) master
#+end_src

Hours Logged this week, last week, and %change.

#+begin_src sql :noweb-ref hours-logged-diff-sql
  SELECT hours_logged_this_week, hours_logged_last_week,
              percentage_change(hours_logged_this_week, hours_logged_last_week)
  FROM (SELECT (this_week).hours_logged_this_week, hours_logged_last_week
   FROM (SELECT this_week, sum(last_week.minutes) AS hours_logged_last_week
    FROM (SELECT rng, sum(minutes) AS hours_logged_this_week
     FROM timecard this_week JOIN
      (SELECT (e.end - interval '1 week') AS start, e.end FROM
       (SELECT now() - interval '1 week' AS end) e) rng ON (this_week.date > rng.end)
         WHERE this_week.date IS NOT NULL GROUP BY rng) this_week
         LEFT JOIN timecard last_week
         ON (last_week.date <@ tstzrange((this_week.rng).start, (this_week.rng).end))
              GROUP BY this_week) hrs) rep;
#+end_src

Dollars Billed this, last, change

#+begin_src sql :noweb-ref dollars-billed-diff-sql
     SELECT this_week::money, last_week::money, percentage_change(this_week, last_week)
      FROM (SELECT sum(CASE WHEN transaction_date > rng.end THEN amount ELSE 0 END) AS this_week,
                   sum(CASE WHEN transaction_date <= rng.end THEN amount ELSE 0 END) AS last_week
      FROM claim_transaction two
      JOIN (SELECT (e.end - interval '1 week') AS start, e.end
            FROM (SELECT now() - interval '1 week' AS end) e) rng ON (two.transaction_date > rng.start)
       WHERE two.transaction_type_id = 4 AND two.transaction_heading = 'TPA' AND person_name(two.payee_id) ILIKE 'Maxwell%') rep ;
#+end_src

#+RESULTS:
| this_week  | last_week  | percentage_change |
|------------+------------+-------------------|
| $51,252.23 | $94,740.02 |               -46 |


** Open Claim Indemnity

#+begin_src sql
  CREATE TABLE IF NOT EXISTS claim_indemnity (
   claim_id INTEGER PRIMARY KEY REFERENCES claim(claim_id),
   paid MONEY NOT NULL DEFAULT 0,
   outstanding_reserve MONEY NOT NULL DEFAULT 0
  );
#+end_src

#+begin_src sql
  CREATE OR REPLACE FUNCTION claim_indemnity_upsert(int)
  RETURNS claim_indemnity LANGUAGE SQL AS $$
  INSERT INTO claim_indemnity(claim_id, paid, outstanding_reserve)
   VALUES ($1, claim_indemnity_paid($1), claim_indemnity_outstanding_reserve($1))
   ON CONFLICT (claim_id) DO UPDATE
    SET paid = EXCLUDED.paid, outstanding_reserve = EXCLUDED.outstanding_reserve
    WHERE claim_indemnity.claim_id = $1
  RETURNING claim_indemnity;
  $$;
#+end_src

#+begin_src sql
  CREATE OR REPLACE FUNCTION claim_indemnity(claim_id INT)
   RETURNS claim_indemnity LANGUAGE SQL AS $$
   SELECT CASE WHEN c IS NOT NULL THEN c
               ELSE claim_indemnity_upsert($1)
   END FROM (SELECT (SELECT c FROM claim_indemnity c WHERE claim_id = $1) c) ex;
  $$;
#+End_src

#+begin_src sql
  CREATE OR REPLACE FUNCTION claim_indemnity_upsert()
   RETURNS TRIGGER LANGUAGE PLPGSQL AS $$
   BEGIN
    IF (TG_OP = 'UPDATE' AND NEW.claim_id != OLD.claim_id) THEN
     PERFORM claim_indemnity_upsert(OLD.claim_id);
    END IF;
    PERFORM claim_indemnity_upsert(NEW.claim_id);
    RETURN NEW;
   END;
  $$;
#+end_src

#+begin_src sql
  CREATE TRIGGER claim_indemnity_upsert
   AFTER INSERT OR UPDATE OR DELETE ON claim
  FOR EACH ROW EXECUTE FUNCTION claim_indemnity_upsert();

  CREATE TRIGGER claim_indemnity_upsert
   AFTER INSERT OR UPDATE OR DELETE ON claim_transaction
  FOR EACH ROW EXECUTE FUNCTION claim_indemnity_upsert();

#+end_src
#+RESULTS:
| CREATE TRIGGER |
|----------------|
| CREATE TRIGGER |

** Examiner Open Claims

  #+BEGIN_SRC sql :results code :exports none
  select pg_get_functiondef(oid)||';' AS " "
  from pg_proc
  where proname = 'examiner_open_claims_report';
  #+END_SRC

  #+begin_src sql
   DROP FUNCTION IF EXISTS examiner_open_claims_report(integer) ;
    CREATE OR REPLACE FUNCTION public.examiner_open_claims_report(integer DEFAULT NULL::integer)
     RETURNS TABLE(examiner text, examiner_id int, claim_id integer, contract_number text, policy_number text, insured text, class_of_business text, province text, incurred_indemntity numeric, outstanding_indemnity numeric)
     LANGUAGE sql
    AS $function$
       SELECT * FROM (SELECT
         person_short_name((claim).adjuster_id) AS examiner , (claim).adjuster_id AS examiner_id, claim_id, (contract).contract_number,
        (policy).policy_number, person_name((policy).insured_id),
        (claim).line_of_business, claim_province(claim_id),
        (paid + outstanding_reserve)::numeric,
        outstanding_reserve::numeric

        FROM (SELECT (claim_indemnity(claim_id)).* FROM claim
               WHERE status = 'Open'
            AND (($1 IS NULL) OR (claim).adjuster_id = $1)) opens
        LEFT JOIN claim_view USING (claim_id)
       ) rep
       ORDER BY examiner , claim_id;
      $function$
    ;
  #+end_src
#+begin_src sql
  CREATE OR REPLACE FUNCTION examiner_open_claims_report_json(integer DEFAULT NULL::integer)
  RETURNS json LANGUAGE SQL AS $$
  SELECT json_build_object('head', head::json, 'data', rows)
   FROM (SELECT head::text AS head, json_agg(row) AS rows
         FROM (SELECT (SELECT json_agg(value) AS row FROM json_each(to_json(e))),
                      (SELECT json_agg(key) AS head FROM json_each(to_json(e)))
                FROM examiner_open_claims_report() e) rep GROUP BY head::text) jso;
  $$;
#+end_src
  #+RESULTS:
  | CREATE FUNCTION |
  |-----------------|

